# Въвеждане на размерите на страните на паралелепипеда
dalshina = float(input("Въведете дължината на паралелепипеда: "))
shirochina = float(input("Въведете широчината на паралелепипеда: "))
visochina = float(input("Въведете височината на паралелепипеда: "))

# Проверка дали размерите са положителни
if dalshina <= 0 or shirochina <= 0 or visochina <= 0:
    print("Невъзможно е да съществува паралелепипед с тези размери. Всички размери трябва да са положителни.")
else:
# Изчисляване на обема
    obem = dalshina * shirochina * visochina
    print(f"Обемът на паралелепипеда е: {obem} кубически единици.")